In [58]:
import pandas as pd
people = {'first_name':['Jason','Tony','John'], 'last_name':['Bourne','Stark','Wick'],'email':['bourne.jason@yahoo.com','stark.tony@gmail.com','wick.john@apple.com']}

In [59]:
people2 = {'first_name':['Jason','Tony'], 'last_name':['Bourne','Stark']}
df2 = pd.DataFrame(data=people2, columns=['first_name','last_name'])

In [60]:
df = pd.DataFrame(data=people, columns=['first_name','last_name','email'])

In [61]:
df['Full Name'] = df['first_name'] + ' ' + df['last_name']

In [62]:
df

  first_name last_name                   email     Full Name
0      Jason    Bourne  bourne.jason@yahoo.com  Jason Bourne
1       Tony     Stark    stark.tony@gmail.com    Tony Stark
2       John      Wick     wick.john@apple.com     John Wick

In [63]:
df.drop('Full Name', axis=1,inplace=True)

In [64]:
df

  first_name last_name                   email
0      Jason    Bourne  bourne.jason@yahoo.com
1       Tony     Stark    stark.tony@gmail.com
2       John      Wick     wick.john@apple.com

In [65]:
df['Full Name'] = df['first_name'] + ' ' + df['last_name']
df

  first_name last_name                   email     Full Name
0      Jason    Bourne  bourne.jason@yahoo.com  Jason Bourne
1       Tony     Stark    stark.tony@gmail.com    Tony Stark
2       John      Wick     wick.john@apple.com     John Wick

In [66]:
df['Full Name'].str.split(' ')

0    [Jason, Bourne]
1      [Tony, Stark]
2       [John, Wick]
Name: Full Name, dtype: object

In [67]:
df['Full Name'].str.split(' ', expand=True)

       0       1
0  Jason  Bourne
1   Tony   Stark
2   John    Wick

In [68]:
df.drop(columns=['first_name','last_name'], inplace=True)
df

                    email     Full Name
0  bourne.jason@yahoo.com  Jason Bourne
1    stark.tony@gmail.com    Tony Stark
2     wick.john@apple.com     John Wick

In [69]:
df[['fname','lname']] = df['Full Name'].str.split(' ', expand=True)
df

                    email     Full Name  fname   lname
0  bourne.jason@yahoo.com  Jason Bourne  Jason  Bourne
1    stark.tony@gmail.com    Tony Stark   Tony   Stark
2     wick.john@apple.com     John Wick   John    Wick

In [70]:
df

                    email     Full Name  fname   lname
0  bourne.jason@yahoo.com  Jason Bourne  Jason  Bourne
1    stark.tony@gmail.com    Tony Stark   Tony   Stark
2     wick.john@apple.com     John Wick   John    Wick

In [71]:
df2

  first_name last_name
0      Jason    Bourne
1       Tony     Stark

In [72]:
df[['new_col1','new_col2']] = df2

In [73]:
df

                    email     Full Name  fname   lname new_col1 new_col2
0  bourne.jason@yahoo.com  Jason Bourne  Jason  Bourne    Jason   Bourne
1    stark.tony@gmail.com    Tony Stark   Tony   Stark     Tony    Stark
2     wick.john@apple.com     John Wick   John    Wick      NaN      NaN

In [75]:
people3 = {'first_name':['Jason','Tony'], 'last_name':['Bourne','Stark']}
df3 = pd.DataFrame(data=people2, columns=['first_name','last_name'])
people4 = {'first_name':['Novy','Roy'], 'last_name':['Clark','Smith']}
df4 = pd.DataFrame(data=people2, columns=['first_name','last_name'])

In [87]:
df3.append(df4, ignore_index=True,sort=True)

C:\Users\prabh\AppData\Local\Temp\ipykernel_11512\2790863127.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3.append(df4, ignore_index=True,sort=True)

  first_name last_name
0      Jason    Bourne
1       Tony     Stark
2      Jason    Bourne
3       Tony     Stark